balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/16xxxx/PIC16F1937.PIC
        <edc:AdjustPoint edc:offset="5"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG0COM0" edc:desc="" edc:mask="0x1" edc:name="SEG0COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM0" edc:desc="" edc:mask="0x1" edc:name="SEG1COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM0" edc:desc="" edc:mask="0x1" edc:name="SEG2COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM0" edc:desc="" edc:mask="0x1" edc:name="SEG3COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM0" edc:desc="" edc:mask="0x1" edc:name="SEG4COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM0" edc:desc="" edc:mask="0x1" edc:name="SEG5COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM0" edc:desc="" edc:mask="0x1" edc:name="SEG6COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM0" edc:desc="" edc:mask="0x1" edc:name="SEG7COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG8COM0" edc:desc="" edc:mask="0x1" edc:name="SEG8COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM0" edc:desc="" edc:mask="0x1" edc:name="SEG9COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM0" edc:desc="" edc:mask="0x1" edc:name="SEG10COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM0" edc:desc="" edc:mask="0x1" edc:name="SEG11COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM0" edc:desc="" edc:mask="0x1" edc:name="SEG12COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM0" edc:desc="" edc:mask="0x1" edc:name="SEG13COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM0" edc:desc="" edc:mask="0x1" edc:name="SEG14COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM0" edc:desc="" edc:mask="0x1" edc:name="SEG15COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG16COM0" edc:desc="" edc:mask="0x1" edc:name="SEG16COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG17COM0" edc:desc="" edc:mask="0x1" edc:name="SEG17COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG18COM0" edc:desc="" edc:mask="0x1" edc:name="SEG18COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG19COM0" edc:desc="" edc:mask="0x1" edc:name="SEG19COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG20COM0" edc:desc="" edc:mask="0x1" edc:name="SEG20COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG21COM0" edc:desc="" edc:mask="0x1" edc:name="SEG21COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG22COM0" edc:desc="" edc:mask="0x1" edc:name="SEG22COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG23COM0" edc:desc="" edc:mask="0x1" edc:name="SEG23COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG0COM1" edc:desc="" edc:mask="0x1" edc:name="SEG0COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM1" edc:desc="" edc:mask="0x1" edc:name="SEG1COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM1" edc:desc="" edc:mask="0x1" edc:name="SEG2COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM1" edc:desc="" edc:mask="0x1" edc:name="SEG3COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM1" edc:desc="" edc:mask="0x1" edc:name="SEG4COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM1" edc:desc="" edc:mask="0x1" edc:name="SEG5COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM1" edc:desc="" edc:mask="0x1" edc:name="SEG6COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM1" edc:desc="" edc:mask="0x1" edc:name="SEG7COM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG8COM1" edc:desc="" edc:mask="0x1" edc:name="SEG8COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM1" edc:desc="" edc:mask="0x1" edc:name="SEG9COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM1" edc:desc="" edc:mask="0x1" edc:name="SEG10COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM1" edc:desc="" edc:mask="0x1" edc:name="SEG11COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM1" edc:desc="" edc:mask="0x1" edc:name="SEG12COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM1" edc:desc="" edc:mask="0x1" edc:name="SEG13COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM1" edc:desc="" edc:mask="0x1" edc:name="SEG14COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM1" edc:desc="" edc:mask="0x1" edc:name="SEG15COM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG16COM1" edc:desc="" edc:mask="0x1" edc:name="SEG16COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG17COM1" edc:desc="" edc:mask="0x1" edc:name="SEG17COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG18COM1" edc:desc="" edc:mask="0x1" edc:name="SEG18COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG19COM1" edc:desc="" edc:mask="0x1" edc:name="SEG19COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG20COM1" edc:desc="" edc:mask="0x1" edc:name="SEG20COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG21COM1" edc:desc="" edc:mask="0x1" edc:name="SEG21COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG22COM1" edc:desc="" edc:mask="0x1" edc:name="SEG22COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG23COM1" edc:desc="" edc:mask="0x1" edc:name="SEG23COM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG0COM2" edc:desc="" edc:mask="0x1" edc:name="SEG0COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM2" edc:desc="" edc:mask="0x1" edc:name="SEG1COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM2" edc:desc="" edc:mask="0x1" edc:name="SEG2COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM2" edc:desc="" edc:mask="0x1" edc:name="SEG3COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM2" edc:desc="" edc:mask="0x1" edc:name="SEG4COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM2" edc:desc="" edc:mask="0x1" edc:name="SEG5COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM2" edc:desc="" edc:mask="0x1" edc:name="SEG6COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM2" edc:desc="" edc:mask="0x1" edc:name="SEG7COM2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG8COM2" edc:desc="" edc:mask="0x1" edc:name="SEG8COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM2" edc:desc="" edc:mask="0x1" edc:name="SEG9COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM2" edc:desc="" edc:mask="0x1" edc:name="SEG10COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM2" edc:desc="" edc:mask="0x1" edc:name="SEG11COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM2" edc:desc="" edc:mask="0x1" edc:name="SEG12COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM2" edc:desc="" edc:mask="0x1" edc:name="SEG13COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM2" edc:desc="" edc:mask="0x1" edc:name="SEG14COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM2" edc:desc="" edc:mask="0x1" edc:name="SEG15COM2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA8" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA8" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG16COM2" edc:desc="" edc:mask="0x1" edc:name="SEG16COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG17COM2" edc:desc="" edc:mask="0x1" edc:name="SEG17COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG18COM2" edc:desc="" edc:mask="0x1" edc:name="SEG18COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG19COM2" edc:desc="" edc:mask="0x1" edc:name="SEG19COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG20COM2" edc:desc="" edc:mask="0x1" edc:name="SEG20COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG21COM2" edc:desc="" edc:mask="0x1" edc:name="SEG21COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG22COM2" edc:desc="" edc:mask="0x1" edc:name="SEG22COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG23COM2" edc:desc="" edc:mask="0x1" edc:name="SEG23COM2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA9" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA9" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG0COM3" edc:desc="" edc:mask="0x1" edc:name="SEG0COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM3" edc:desc="" edc:mask="0x1" edc:name="SEG1COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM3" edc:desc="" edc:mask="0x1" edc:name="SEG2COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM3" edc:desc="" edc:mask="0x1" edc:name="SEG3COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM3" edc:desc="" edc:mask="0x1" edc:name="SEG4COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM3" edc:desc="" edc:mask="0x1" edc:name="SEG5COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM3" edc:desc="" edc:mask="0x1" edc:name="SEG6COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM3" edc:desc="" edc:mask="0x1" edc:name="SEG7COM3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
